cases/pyrolysis1D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet         
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    } 

    ground          
    {
        type            fixedValue;
        value           $internalField;
    }

    side          
    {
        type            pressureInletOutletVelocity;
	phi		phi;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }

    region0_to_panelRegion_panel
    {
        //type            flowRateInletVelocityCoupled;
        //phi             phi;
        //nbrPhi         phiGas;
        //rho             rho;
        //value           uniform (0 0 0);
        type            flowRateInletVelocityFuelConvertCoupled;
        phi             phi;
        nbrPhi          phiGas;
        rho             rho;
        hocPyr          2.0229e+07; // DeltaHcVirgin = 1.767e+07 J/kg // (rhoVirgin*DeltaHcVirgin)/(rhoVirgin - rhoChar) //HEAT OF COMBUSTION OF PYROLYSATE IS IN J/kg. 
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
