cases/pyrolysis1D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet          
    {
	type			zeroGradient;
    }

    ground           
    {
	type			zeroGradient;
    }

    side          
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           0;//1.4;
	p0	        $internalField;
	value		$internalField;
    }

    frontAndBack    
    {
        type            empty;
    }

    region0_to_panelRegion_panel
    {
//	type			fixedFluxBuoyantPressure;
	type			buoyantPressure;
	value			$internalField;
    }
}


// ************************************************************************* //
