cases/pyrolysis1D/Allrun.pre
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication setSet -batch system/makeFaceSet.setSet

runApplication extrudeToRegionMesh -overwrite


# -----------------------------------------------------------------------------
