cases/pyrolysis1D/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//combustionModel    infinitelyFastChemistry<psiCombustionModel,gasThermoPhysics>;
combustionModel    infinitelyFastChemistry<psiThermoCombustion,gasHThermoPhysics>;

infinitelyFastChemistryCoeffs
{
    semiImplicit no;
//    C       10;
    C       10;
}

coherentFlameCoeffs
{

}

noCombustionCoeffs
{
}

XiModel transport;

transportCoeffs
{
    alpha   3.0;
    beta    30.0;
    YoO     0.23;
}

laminarFlameSpeedCorrelation Gulders;

fuel            Propane;

Su              Su [ 0 1 -1 0 0 0 0 ] 0.135;

SuModel         transport;

equivalenceRatio equivalenceRatio [ 0 0 0 0 0 0 0 ] 0.6;

sigmaExt        sigmaExt [ 0 0 -1 0 0 0 0 ] 338;


XiCoef          XiCoef [ 0 0 0 0 0 0 0 ] 0.62;

XiShapeCoef     XiShapeCoef [ 0 0 0 0 0 0 0 ] 1;

uPrimeCoef      uPrimeCoef [ 0 0 0 0 0 0 0 ] 1;

GuldersCoeffs
{
    Methane
    {
        W               0.422;
        eta             0.15;
        xi              5.18;
        alpha           2;
        beta            -0.5;
        f               2.3;
    }

    Propane
    {
        W               0.446;
        eta             0.12;
        xi              4.95;
        alpha           1.77;
        beta            -0.2;
        f               2.3;
    }

    IsoOctane
    {
        W               0.4658;
        eta             -0.326;
        xi              4.48;
        alpha           1.56;
        beta            -0.22;
        f               2.3;
    }
}


// ************************************************************************* //
