cases/pyrolysis1D/system/makeFaceSet.setSet
faceSet coupledPatch new patchToFace coupledPatch
faceZoneSet panel new setToFaceZone coupledPatch

