cases/pyrolysis1D/system/panelRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/pyrolysisRegion";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default        none;
}

laplacianSchemes
{
    default         none;
    //laplacian(K,T)  Gauss linear uncorrected;
    laplacian(kappa,T)  Gauss harmonic uncorrected;
    laplacian(thermo:alpha,h)  Gauss harmonic uncorrected;
    laplacian(kappa,T) Gauss harmonic uncorrected;
}

interpolationSchemes
{
    default         linear;
    //default         none;
    interpolate(K) harmonic;
}

snGradSchemes
{
    default        uncorrected;
}

fluxRequired
{
    default         no;
}

// ************************************************************************* //
